meeting/agenda/2022/09-27.org
:PROPERTIES:
:ID:       943BAD8C-39DA-455A-A896-C4545E0EEDB0
:END:
#+title: QT4 CG Meeting 004 Agenda 2022-09-27
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showeverything

* Agenda
:PROPERTIES:
:unnumbered: t
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia

** Roll call

** Approve minutes of previous meeting

Minutes of the previous meeting: [[../../minutes/2022/09-20.html][https://qt4cg.org/meeting/minutes/2022/09-20.html]].

As [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0047.html][amended]] on 20 September 2022 by MK.

** Review of  open action items [3/6]

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-002-01: NW to incorporate email feedback and produce new
  versions of the process documents. 
+ [X] QT4CG-003-01: MK to find a way to specify =fn:characters()= more formally
  + https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0044.html
+ [X] QT4CG-003-02: MK to propose a reformulation of =fn:index-of()= in terms of =fn:index-where()=
  + https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0045.html
+ [ ] QT4CG-003-03: NW to tweak the CSS for function signatures to avoid line breaks on =-= characters.
+ [ ] QT4CG-003-04: MK to rename =fn:uniform()= and =fn:unique()= to =fn:all-equal()= and =fn:all-different()=, respectively
+ [X] QT4CG-003-05: MK to consider how =fn:array-filter()= could be generalized to handle array predicates on the index as well as the value.
  + https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0046.html

* Technical Agenda

** XPath 4.0 functions
  + See https://github.com/qt4cg/qtspecs/blob/master/editorial/functions-checklist.pdf

The items that follow are taken from the PDF in roughly the order
presented in the PDF. The agenda does not intend to assert that they
must or should be discussed in precisely this order.

*** fn:differences
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-differences
*** fn:json
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-json
*** fn:range-from
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-range-from
*** fn:range-to
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-range-to
*** fn:replicate
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replicate
*** fn:slice
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-slice
*** fn:stack-trace
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-stack-trace
*** map:group-by
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-group-by
*** map:replace
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-replace
*** map:substitute
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-substitute
*** map:entries
+ See https://github.com/qt4cg/qtspecs/issues/29
+ See https://github.com/qt4cg/qtspecs/issues/113
*** array:replace
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-replace
*** array:slice
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-slice
*** array:partition
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-partition
*** fn:parts
+ See ???
*** fn:items-before
+ Unspecified, see https://qt4cg.org/specifications/xpath-functions-40/Overview.html#new-functions
*** fn:items-after
+ Unspecified, see https://qt4cg.org/specifications/xpath-functions-40/Overview.html#new-functions
*** fn:items-from
+ Unspecified, see https://qt4cg.org/specifications/xpath-functions-40/Overview.html#new-functions
*** fn:items-until
+ Unspecified, see https://qt4cg.org/specifications/xpath-functions-40/Overview.html#new-functions
*** fn:op
+ See https://github.com/qt4cg/qtspecs/issues/83
*** fn:init, fn:foot, etc
+ See https://github.com/qt4cg/qtspecs/issues/97
*** fn:sequence-contains, fn:sequence-starts-with, fn:sequence-ends-with
+ See https://github.com/qt4cg/qtspecs/issues/94
+ See https://github.com/qt4cg/qtspecs/issues/96
*** fn:convert-to/from-EQName
+ See https://github.com/qt4cg/qtspecs/issues/1
*** fn:intersperse
+ See https://github.com/qt4cg/qtspecs/issues/2
*** fn:parse-html
+ See https://github.com/qt4cg/qtspecs/issues/74
*** fn:split-by-graphemes
+ See https://github.com/qt4cg/qtspecs/issues/73
*** fn:until
+ See https://github.com/qt4cg/qtspecs/issues/80
*** fn:nl, fn:cr, fn:tab
+ See https://github.com/qt4cg/qtspecs/issues/121
*** fn:deep-normalize-space
+ See https://github.com/qt4cg/qtspecs/issues/79
*** fn:parcel, fn:unparcel, array:from-members/of, array:members/parcels
+ See https://github.com/qt4cg/qtspecs/issues/113
*** fn:duplicate-values
+ See https://github.com/qt4cg/qtspecs/issues/123
*** array:values, map:values
+ See https://github.com/qt4cg/qtspecs/issues/29
*** fn:replace (action) 
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replace
*** fn:distinct-values (semantics)
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-distinct-values
*** fn:deep-equal (options)
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-deep-equal
*** fn:parse-json (number formatting)
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-parse-json
*** fn:format-number (minor fixes)
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-format-number

* Any other business
