meeting/agenda/2022/09-27.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 004 Agenda 2022-09-27</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 004 Agenda 2022-09-27</h1>

<div id="outline-container-org57da66f" class="outline-2">
<h2 id="org57da66f">Agenda</h2>
<div class="outline-text-2" id="text-org57da66f">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-org341185b" class="outline-2">
<h2 id="org341185b"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1ec0bff" class="outline-3">
<h3 id="org1ec0bff"><span class="section-number-3">1.1.</span> Roll call</h3>
</div>

<div id="outline-container-org7e10d3c" class="outline-3">
<h3 id="org7e10d3c"><span class="section-number-3">1.2.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Minutes of the previous meeting: <a href="../../minutes/2022/09-20.html">https://qt4cg.org/meeting/minutes/2022/09-20.html</a>.
</p>

<p>
As <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0047.html">amended</a> on 20 September 2022 by MK.
</p>
</div>
</div>

<div id="outline-container-org3036baa" class="outline-3">
<h3 id="org3036baa"><span class="section-number-3">1.3.</span> Review of  open action items <code>[3/6]</code></h3>
<div class="outline-text-3" id="text-1-3">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-01: NW to incorporate email feedback and produce new
versions of the process documents.</li>
<li class="on"><code>[X]</code> QT4CG-003-01: MK to find a way to specify <code>fn:characters()</code> more formally
<ul class="org-ul">
<li><a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0044.html">https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0044.html</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-003-02: MK to propose a reformulation of <code>fn:index-of()</code> in terms of <code>fn:index-where()</code>
<ul class="org-ul">
<li><a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0045.html">https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0045.html</a></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-003-03: NW to tweak the CSS for function signatures to avoid line breaks on <code>-</code> characters.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-003-04: MK to rename <code>fn:uniform()</code> and <code>fn:unique()</code> to <code>fn:all-equal()</code> and <code>fn:all-different()</code>, respectively</li>
<li class="on"><code>[X]</code> QT4CG-003-05: MK to consider how <code>fn:array-filter()</code> could be generalized to handle array predicates on the index as well as the value.
<ul class="org-ul">
<li><a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0046.html">https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0046.html</a></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org1e46beb" class="outline-2">
<h2 id="org1e46beb"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2950bfe" class="outline-3">
<h3 id="org2950bfe"><span class="section-number-3">2.1.</span> XPath 4.0 functions</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/blob/master/editorial/functions-checklist.pdf">https://github.com/qt4cg/qtspecs/blob/master/editorial/functions-checklist.pdf</a></li>
</ul>

<p>
The items that follow are taken from the PDF in roughly the order
presented in the PDF. The agenda does not intend to assert that they
must or should be discussed in precisely this order.
</p>
</div>

<div id="outline-container-org4da7ac0" class="outline-4">
<h4 id="org4da7ac0"><span class="section-number-4">2.1.1.</span> fn:differences</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-differences">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-differences</a></li>
</ul>
</div>
</div>
<div id="outline-container-org61a3437" class="outline-4">
<h4 id="org61a3437"><span class="section-number-4">2.1.2.</span> fn:json</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-json">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-json</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf3a1576" class="outline-4">
<h4 id="orgf3a1576"><span class="section-number-4">2.1.3.</span> fn:range-from</h4>
<div class="outline-text-4" id="text-2-1-3">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-range-from">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-range-from</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga86a03d" class="outline-4">
<h4 id="orga86a03d"><span class="section-number-4">2.1.4.</span> fn:range-to</h4>
<div class="outline-text-4" id="text-2-1-4">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-range-to">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-range-to</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7fb0d4a" class="outline-4">
<h4 id="org7fb0d4a"><span class="section-number-4">2.1.5.</span> fn:replicate</h4>
<div class="outline-text-4" id="text-2-1-5">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replicate">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replicate</a></li>
</ul>
</div>
</div>
<div id="outline-container-org333741f" class="outline-4">
<h4 id="org333741f"><span class="section-number-4">2.1.6.</span> fn:slice</h4>
<div class="outline-text-4" id="text-2-1-6">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-slice">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-slice</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9860260" class="outline-4">
<h4 id="org9860260"><span class="section-number-4">2.1.7.</span> fn:stack-trace</h4>
<div class="outline-text-4" id="text-2-1-7">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-stack-trace">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-stack-trace</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgdb6490c" class="outline-4">
<h4 id="orgdb6490c"><span class="section-number-4">2.1.8.</span> map:group-by</h4>
<div class="outline-text-4" id="text-2-1-8">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-group-by">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-group-by</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgca51e11" class="outline-4">
<h4 id="orgca51e11"><span class="section-number-4">2.1.9.</span> map:replace</h4>
<div class="outline-text-4" id="text-2-1-9">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-replace">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-replace</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf353819" class="outline-4">
<h4 id="orgf353819"><span class="section-number-4">2.1.10.</span> map:substitute</h4>
<div class="outline-text-4" id="text-2-1-10">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-substitute">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-substitute</a></li>
</ul>
</div>
</div>
<div id="outline-container-org58c7704" class="outline-4">
<h4 id="org58c7704"><span class="section-number-4">2.1.11.</span> map:entries</h4>
<div class="outline-text-4" id="text-2-1-11">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/29">https://github.com/qt4cg/qtspecs/issues/29</a></li>
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/113">https://github.com/qt4cg/qtspecs/issues/113</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4e1d91f" class="outline-4">
<h4 id="org4e1d91f"><span class="section-number-4">2.1.12.</span> array:replace</h4>
<div class="outline-text-4" id="text-2-1-12">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-replace">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-replace</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc31ef5d" class="outline-4">
<h4 id="orgc31ef5d"><span class="section-number-4">2.1.13.</span> array:slice</h4>
<div class="outline-text-4" id="text-2-1-13">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-slice">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-slice</a></li>
</ul>
</div>
</div>
<div id="outline-container-org624d706" class="outline-4">
<h4 id="org624d706"><span class="section-number-4">2.1.14.</span> array:partition</h4>
<div class="outline-text-4" id="text-2-1-14">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-partition">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-partition</a></li>
</ul>
</div>
</div>
<div id="outline-container-org050ac3a" class="outline-4">
<h4 id="org050ac3a"><span class="section-number-4">2.1.15.</span> fn:parts</h4>
<div class="outline-text-4" id="text-2-1-15">
<ul class="org-ul">
<li>See ???</li>
</ul>
</div>
</div>
<div id="outline-container-orgb475e3a" class="outline-4">
<h4 id="orgb475e3a"><span class="section-number-4">2.1.16.</span> fn:items-before</h4>
<div class="outline-text-4" id="text-2-1-16">
<ul class="org-ul">
<li>Unspecified, see <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#new-functions">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#new-functions</a></li>
</ul>
</div>
</div>
<div id="outline-container-org902f9ad" class="outline-4">
<h4 id="org902f9ad"><span class="section-number-4">2.1.17.</span> fn:items-after</h4>
<div class="outline-text-4" id="text-2-1-17">
<ul class="org-ul">
<li>Unspecified, see <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#new-functions">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#new-functions</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1a33a52" class="outline-4">
<h4 id="org1a33a52"><span class="section-number-4">2.1.18.</span> fn:items-from</h4>
<div class="outline-text-4" id="text-2-1-18">
<ul class="org-ul">
<li>Unspecified, see <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#new-functions">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#new-functions</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbc17cae" class="outline-4">
<h4 id="orgbc17cae"><span class="section-number-4">2.1.19.</span> fn:items-until</h4>
<div class="outline-text-4" id="text-2-1-19">
<ul class="org-ul">
<li>Unspecified, see <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#new-functions">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#new-functions</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2f688fc" class="outline-4">
<h4 id="org2f688fc"><span class="section-number-4">2.1.20.</span> fn:op</h4>
<div class="outline-text-4" id="text-2-1-20">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/83">https://github.com/qt4cg/qtspecs/issues/83</a></li>
</ul>
</div>
</div>
<div id="outline-container-org16ea615" class="outline-4">
<h4 id="org16ea615"><span class="section-number-4">2.1.21.</span> fn:init, fn:foot, etc</h4>
<div class="outline-text-4" id="text-2-1-21">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/97">https://github.com/qt4cg/qtspecs/issues/97</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7fd1f6b" class="outline-4">
<h4 id="org7fd1f6b"><span class="section-number-4">2.1.22.</span> fn:sequence-contains, fn:sequence-starts-with, fn:sequence-ends-with</h4>
<div class="outline-text-4" id="text-2-1-22">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/94">https://github.com/qt4cg/qtspecs/issues/94</a></li>
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/96">https://github.com/qt4cg/qtspecs/issues/96</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbb51010" class="outline-4">
<h4 id="orgbb51010"><span class="section-number-4">2.1.23.</span> fn:convert-to/from-EQName</h4>
<div class="outline-text-4" id="text-2-1-23">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/1">https://github.com/qt4cg/qtspecs/issues/1</a></li>
</ul>
</div>
</div>
<div id="outline-container-org52a652c" class="outline-4">
<h4 id="org52a652c"><span class="section-number-4">2.1.24.</span> fn:intersperse</h4>
<div class="outline-text-4" id="text-2-1-24">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/2">https://github.com/qt4cg/qtspecs/issues/2</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgab2962d" class="outline-4">
<h4 id="orgab2962d"><span class="section-number-4">2.1.25.</span> fn:parse-html</h4>
<div class="outline-text-4" id="text-2-1-25">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/74">https://github.com/qt4cg/qtspecs/issues/74</a></li>
</ul>
</div>
</div>
<div id="outline-container-org79faff7" class="outline-4">
<h4 id="org79faff7"><span class="section-number-4">2.1.26.</span> fn:split-by-graphemes</h4>
<div class="outline-text-4" id="text-2-1-26">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/73">https://github.com/qt4cg/qtspecs/issues/73</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgfea4d54" class="outline-4">
<h4 id="orgfea4d54"><span class="section-number-4">2.1.27.</span> fn:until</h4>
<div class="outline-text-4" id="text-2-1-27">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/80">https://github.com/qt4cg/qtspecs/issues/80</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd152adb" class="outline-4">
<h4 id="orgd152adb"><span class="section-number-4">2.1.28.</span> fn:nl, fn:cr, fn:tab</h4>
<div class="outline-text-4" id="text-2-1-28">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/121">https://github.com/qt4cg/qtspecs/issues/121</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4546ef6" class="outline-4">
<h4 id="org4546ef6"><span class="section-number-4">2.1.29.</span> fn:deep-normalize-space</h4>
<div class="outline-text-4" id="text-2-1-29">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/79">https://github.com/qt4cg/qtspecs/issues/79</a></li>
</ul>
</div>
</div>
<div id="outline-container-org783fa9a" class="outline-4">
<h4 id="org783fa9a"><span class="section-number-4">2.1.30.</span> fn:parcel, fn:unparcel, array:from-members/of, array:members/parcels</h4>
<div class="outline-text-4" id="text-2-1-30">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/113">https://github.com/qt4cg/qtspecs/issues/113</a></li>
</ul>
</div>
</div>
<div id="outline-container-org39e9473" class="outline-4">
<h4 id="org39e9473"><span class="section-number-4">2.1.31.</span> fn:duplicate-values</h4>
<div class="outline-text-4" id="text-2-1-31">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/123">https://github.com/qt4cg/qtspecs/issues/123</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3e5ab82" class="outline-4">
<h4 id="org3e5ab82"><span class="section-number-4">2.1.32.</span> array:values, map:values</h4>
<div class="outline-text-4" id="text-2-1-32">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/29">https://github.com/qt4cg/qtspecs/issues/29</a></li>
</ul>
</div>
</div>
<div id="outline-container-org72e6793" class="outline-4">
<h4 id="org72e6793"><span class="section-number-4">2.1.33.</span> fn:replace (action)</h4>
<div class="outline-text-4" id="text-2-1-33">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replace">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replace</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0bd725e" class="outline-4">
<h4 id="org0bd725e"><span class="section-number-4">2.1.34.</span> fn:distinct-values (semantics)</h4>
<div class="outline-text-4" id="text-2-1-34">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-distinct-values">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-distinct-values</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9e0d549" class="outline-4">
<h4 id="org9e0d549"><span class="section-number-4">2.1.35.</span> fn:deep-equal (options)</h4>
<div class="outline-text-4" id="text-2-1-35">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-deep-equal">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-deep-equal</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7a17bfd" class="outline-4">
<h4 id="org7a17bfd"><span class="section-number-4">2.1.36.</span> fn:parse-json (number formatting)</h4>
<div class="outline-text-4" id="text-2-1-36">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-parse-json">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-parse-json</a></li>
</ul>
</div>
</div>
<div id="outline-container-org19b1b76" class="outline-4">
<h4 id="org19b1b76"><span class="section-number-4">2.1.37.</span> fn:format-number (minor fixes)</h4>
<div class="outline-text-4" id="text-2-1-37">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-format-number">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-format-number</a></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org20613c4" class="outline-2">
<h2 id="org20613c4"><span class="section-number-2">3.</span> Any other business</h2>
</div>
</div>
</body>
</html>
